mlyszczek/nuttx/arch/arm/src/stm32f0l0/hardware/stm32l0xxx_rcc.h
#define RCC_CSR_LSION                   (0)  /* Bit 0: LSI enable */
#define RCC_CSR_LSIRDY                  (1)  /* Bit 1: ready */
                                             /* Bits 3-7: Reserved */
#define RCC_CSR_LSEON                   (8)  /* Bit 8: LSE enable */
#define RCC_CSR_LSERDY                  (9)  /* Bit 9: LSE ready */
#define RCC_CSR_LSEBPY                  (10) /* Bit 10: LSE bypass */
#define RCC_CSR_LSEDRV_SHIFT            (11) /* Bits 11-12: LSE driving capability */
#define RCC_CSR_LSEDRV_MASK             (3 << RCC_CSR_LSEDRV_SHIFT)
#  define RCC_CSR_LSEDRV_LOW            (0 << RCC_CSR_LSEDRV_SHIFT)
#  define RCC_CSR_LSEDRV_MEDLOW         (1 << RCC_CSR_LSEDRV_SHIFT)
#  define RCC_CSR_LSEDRV_MEDHGIH        (2 << RCC_CSR_LSEDRV_SHIFT)
#  define RCC_CSR_LSEDRV_HIGH           (3 << RCC_CSR_LSEDRV_SHIFT)
#define RCC_CSR_CSSLSEON                (13) /* Bit 13: CSS on LSE enable */
#define RCC_CSR_CSSLSED                 (14) /* Bit 14: CSS on LSE failure detection flag */
                                             /* Bit 15: Reserved */
#define RCC_CSR_RTCSEL_SHIFT            (16) /* Bits 16-17: RTC clock source selection */
#define RCC_CSR_RTCSEL_MASK             (3 << RCC_CSR_RTCSEL_SHIFT)
#  define RCC_CSR_RTCSEL_NOCLK          (0 << RCC_CSR_RTCSEL_SHIFT)
#  define RCC_CSR_RTCSEL_LSE            (1 << RCC_CSR_RTCSEL_SHIFT)
#  define RCC_CSR_RTCSEL_LSI            (2 << RCC_CSR_RTCSEL_SHIFT)
#  define RCC_CSR_RTCSEL_HSE            (3 << RCC_CSR_RTCSEL_SHIFT)
#define RCC_CSR_RTCEN                   (18) /* Bit 18: RTC clock enable */
#define RCC_CSR_RTCRST                  (19) /* Bit 19: RTC software reset */
                                             /* Bits 20-22: Reserved */
#define RCC_CSR_RMVF                    (23) /* Bit 23: Remove reset flag */
#define RCC_CSR_FWRSTF                  (24) /* Bit 24: Firewall reset flag */
#define RCC_CSR_OBLRSTF                 (25) /* Bit 25: Options bytes loading reset flag */
#define RCC_CSR_PINRSTF                 (26) /* Bit 26: PIN reset flag */
#define RCC_CSR_PORRSTF                 (27) /* Bit 27: POR/PDR reset flag */
#define RCC_CSR_SFTRSTF                 (28) /* Bit 28: software reset flag */
#define RCC_CSR_IWDGRSTF                (29) /* Bit 29: IWDG reset flag */
#define RCC_CSR_WWDGRSTF                (30) /* Bit 30: WWDG reset flag */
#define RCC_CSR_LPWRRSTF                (31) /* Bit 31: Low-power reset flag */

#endif /* __ARCH_ARM_SRC_STM32F0L0_HARDWARE_STM32L0XXXX_RCC_H */
